# Student Data
This notebook analyizes pass/fail data for class

In [76]:
names = ['Liam', 'Ava', 'Noah', 'Maya', 'Ethan', 'Chloe', 'Lucas', 'Zara', 'Caleb', 'Oscar', 'Lila', 'Felix', 'Aria', 'Marco', 'Elise', 'Rowan', 'Tessa', 'Julian', 'Ivy', 'Milo', 'Sienna', 'Kai', 'Harper', 'Adrian']

In [77]:
hours = [10, 11.5, 9, 16, 9.25, 1, 11.5, 9, 8.5, 14.5, 15.5, 13.75, 9, 8, 15.5, 8, 9, 6, 10, 12, 12.5, 12, 8, float('nan')]

In [78]:
scores = [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, float('nan'), float('nan')]

In [79]:
import numpy as np

In [80]:
np_names = np.array(names)

In [81]:
np_names.shape

(24,)

In [82]:
np_hours = np.array(hours)

In [83]:
np_hours.shape

(24,)

In [84]:
np_scores = np.array(scores)

In [85]:
np_scores.shape

(24,)

In [86]:
import pandas as pd

In [87]:
df_students = pd.DataFrame({
    "Names": np_names,
    "Hours": np_hours,
    "Scores": np_scores
})

In [88]:
df_students

     Names  Hours  Scores
0     Liam  10.00    50.0
1      Ava  11.50    50.0
2     Noah   9.00    47.0
3     Maya  16.00    97.0
4    Ethan   9.25    49.0
5    Chloe   1.00     3.0
6    Lucas  11.50    53.0
7     Zara   9.00    42.0
8    Caleb   8.50    26.0
9    Oscar  14.50    74.0
10    Lila  15.50    82.0
11   Felix  13.75    62.0
12    Aria   9.00    37.0
13   Marco   8.00    15.0
14   Elise  15.50    70.0
15   Rowan   8.00    27.0
16   Tessa   9.00    36.0
17  Julian   6.00    35.0
18     Ivy  10.00    48.0
19    Milo  12.00    52.0
20  Sienna  12.50    63.0
21     Kai  12.00    64.0
22  Harper   8.00     NaN
23  Adrian    NaN     NaN

In [89]:
df_students.isnull()

    Names  Hours  Scores
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False
4   False  False   False
5   False  False   False
6   False  False   False
7   False  False   False
8   False  False   False
9   False  False   False
10  False  False   False
11  False  False   False
12  False  False   False
13  False  False   False
14  False  False   False
15  False  False   False
16  False  False   False
17  False  False   False
18  False  False   False
19  False  False   False
20  False  False   False
21  False  False   False
22  False  False    True
23  False   True    True

In [90]:
df_students.isnull().sum()

Names     0
Hours     1
Scores    2
dtype: int64

In [91]:
ave_hours = np.nanmean(hours)

In [92]:
ave_hours

np.float64(10.41304347826087)

In [93]:
ave_scores = np.nanmean(scores)

In [94]:
ave_scores

np.float64(49.18181818181818)

In [95]:
df_students[df_students.Hours > ave_hours]

     Names  Hours  Scores
1      Ava  11.50    50.0
3     Maya  16.00    97.0
6    Lucas  11.50    53.0
9    Oscar  14.50    74.0
10    Lila  15.50    82.0
11   Felix  13.75    62.0
14   Elise  15.50    70.0
19    Milo  12.00    52.0
20  Sienna  12.50    63.0
21     Kai  12.00    64.0

In [96]:
df_students[df_students.Hours < ave_hours]

     Names  Hours  Scores
0     Liam  10.00    50.0
2     Noah   9.00    47.0
4    Ethan   9.25    49.0
5    Chloe   1.00     3.0
7     Zara   9.00    42.0
8    Caleb   8.50    26.0
12    Aria   9.00    37.0
13   Marco   8.00    15.0
15   Rowan   8.00    27.0
16   Tessa   9.00    36.0
17  Julian   6.00    35.0
18     Ivy  10.00    48.0
22  Harper   8.00     NaN

In [97]:
df_students

     Names  Hours  Scores
0     Liam  10.00    50.0
1      Ava  11.50    50.0
2     Noah   9.00    47.0
3     Maya  16.00    97.0
4    Ethan   9.25    49.0
5    Chloe   1.00     3.0
6    Lucas  11.50    53.0
7     Zara   9.00    42.0
8    Caleb   8.50    26.0
9    Oscar  14.50    74.0
10    Lila  15.50    82.0
11   Felix  13.75    62.0
12    Aria   9.00    37.0
13   Marco   8.00    15.0
14   Elise  15.50    70.0
15   Rowan   8.00    27.0
16   Tessa   9.00    36.0
17  Julian   6.00    35.0
18     Ivy  10.00    48.0
19    Milo  12.00    52.0
20  Sienna  12.50    63.0
21     Kai  12.00    64.0
22  Harper   8.00     NaN
23  Adrian    NaN     NaN

In [98]:
# df_students = df_students.fillna(df_students.mean(numeric_only=True))

In [99]:
df_students

     Names  Hours  Scores
0     Liam  10.00    50.0
1      Ava  11.50    50.0
2     Noah   9.00    47.0
3     Maya  16.00    97.0
4    Ethan   9.25    49.0
5    Chloe   1.00     3.0
6    Lucas  11.50    53.0
7     Zara   9.00    42.0
8    Caleb   8.50    26.0
9    Oscar  14.50    74.0
10    Lila  15.50    82.0
11   Felix  13.75    62.0
12    Aria   9.00    37.0
13   Marco   8.00    15.0
14   Elise  15.50    70.0
15   Rowan   8.00    27.0
16   Tessa   9.00    36.0
17  Julian   6.00    35.0
18     Ivy  10.00    48.0
19    Milo  12.00    52.0
20  Sienna  12.50    63.0
21     Kai  12.00    64.0
22  Harper   8.00     NaN
23  Adrian    NaN     NaN

In [100]:
df_students = df_students.dropna(axis=0)

In [101]:
df_students

     Names  Hours  Scores
0     Liam  10.00    50.0
1      Ava  11.50    50.0
2     Noah   9.00    47.0
3     Maya  16.00    97.0
4    Ethan   9.25    49.0
5    Chloe   1.00     3.0
6    Lucas  11.50    53.0
7     Zara   9.00    42.0
8    Caleb   8.50    26.0
9    Oscar  14.50    74.0
10    Lila  15.50    82.0
11   Felix  13.75    62.0
12    Aria   9.00    37.0
13   Marco   8.00    15.0
14   Elise  15.50    70.0
15   Rowan   8.00    27.0
16   Tessa   9.00    36.0
17  Julian   6.00    35.0
18     Ivy  10.00    48.0
19    Milo  12.00    52.0
20  Sienna  12.50    63.0
21     Kai  12.00    64.0

In [103]:
df_students[df_students.Hours > ave_hours].Scores.mean()

np.float64(66.7)

In [104]:
passed = pd.Series(df_students.Scores >= 60)

In [105]:
passed

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11     True
12    False
13    False
14     True
15    False
16    False
17    False
18    False
19    False
20     True
21     True
Name: Scores, dtype: bool

In [106]:
df_students = pd.concat([df_students, passed.rename('Passed')], axis=1)

In [107]:
df_students

     Names  Hours  Scores  Passed
0     Liam  10.00    50.0   False
1      Ava  11.50    50.0   False
2     Noah   9.00    47.0   False
3     Maya  16.00    97.0    True
4    Ethan   9.25    49.0   False
5    Chloe   1.00     3.0   False
6    Lucas  11.50    53.0   False
7     Zara   9.00    42.0   False
8    Caleb   8.50    26.0   False
9    Oscar  14.50    74.0    True
10    Lila  15.50    82.0    True
11   Felix  13.75    62.0    True
12    Aria   9.00    37.0   False
13   Marco   8.00    15.0   False
14   Elise  15.50    70.0    True
15   Rowan   8.00    27.0   False
16   Tessa   9.00    36.0   False
17  Julian   6.00    35.0   False
18     Ivy  10.00    48.0   False
19    Milo  12.00    52.0   False
20  Sienna  12.50    63.0    True
21     Kai  12.00    64.0    True

In [109]:
df_students.groupby(df_students.Passed).Names.count()

Passed
False    15
True      7
Name: Names, dtype: int64